/*
 Localized strings for CFErrors returned by AVFoundationCF.

 When displayed in an alert, the strings whose keys end in _Description will be the alert title.
 The strings whose keys end in _RecoverySuggestion or _FailureReason will be the alert body.
 */

"AVFoundationCFErrorDomain_AVCFErrorOutOfMemory_Description" = "Impossible d’effectuer l’action";
"AVFoundationCFErrorDomain_AVCFErrorOutOfMemory_RecoverySuggestion" = "Réessayez plus tard.";

"AVFoundationCFErrorDomain_AVCFErrorFileFormatNotRecognized_Description" = "Ouverture impossible";
"AVFoundationCFErrorDomain_AVCFErrorFileFormatNotRecognized_FailureReason" = "Ce format de données n’est pas reconnu.";
"AVFoundationCFErrorDomain_AVCFErrorFileFailedToParse_Description" = "Ouverture impossible";
"AVFoundationCFErrorDomain_AVCFErrorFileFailedToParse_FailureReason" = "Ce contenu multimédia est peut-être endommagé.";

"AVFoundationCFErrorDomain_AVCFErrorContentIsProtected_Description" = "Ouverture impossible";
"AVFoundationCFErrorDomain_AVCFErrorContentIsProtected_FailureReason" = "Cette app n’est pas autorisée à lire ce fichier."; /* the file is DRM protected */
"AVFoundationCFErrorDomain_AVCFErrorNoImageAtTime_Description" = "Ouverture impossible";
"AVFoundationCFErrorDomain_AVCFErrorNoImageAtTime_FailureReason" = "Ce contenu multimédia est inutilisable.";
"AVFoundationCFErrorDomain_AVCFErrorDecoderTemporarilyUnavailable_Description" = "Décodage impossible";
"AVFoundationCFErrorDomain_AVCFErrorDecoderTemporarilyUnavailable_FailureReason" = "Le décodeur requis pour ce contenu multimédia est occupé.";
"AVFoundationCFErrorDomain_AVCFErrorDecoderTemporarilyUnavailable_RecoverySuggestion" = "Arrêtez toute autre action qui décode du contenu multimédia, puis réessayez.";
"AVFoundationCFErrorDomain_AVCFErrorIncompatibleAsset_Description" = "Ouverture impossible";
"AVFoundationCFErrorDomain_AVCFErrorIncompatibleAsset_FailureReason" = "Impossible d’utiliser le contenu multimédia sur cet ordinateur.";
"AVFoundationCFErrorDomain_AVCFErrorNoCompatibleAlternatesForExternalDisplay_Description" = "Ouverture impossible";
"AVFoundationCFErrorDomain_AVCFErrorNoCompatibleAlternatesForExternalDisplay_FailureReason" = "Impossible de lire ce contenu sur l’écran externe.";
"AVFoundationCFErrorDomain_AVCFErrorInsufficientContentProtectionConfiguration_Description" = "Ouverture impossible";
"AVFoundationCFErrorDomain_AVCFErrorInsufficientContentProtectionConfiguration_FailureReason" = "Impossible de lire le contenu protégé dans la configuration actuelle du système.";
"AVFoundationCFErrorDomain_AVCFErrorTranscodeFrameMismatch_Description" = "La piste vidéo en sortie issue du transcodage contient un nombre incorrect d’images";
"AVFoundationCFErrorDomain_AVCFErrorTranscodeFrameMismatch_FailureReason" = "Le nombre d’images en sortie issues du transcodage ne correspond pas à la source. Cette dernière ne comporte aucun segment modifié.";
"AVFoundationCFErrorDomain_AVCFErrorDecodeFailed_Description" = "Échec de décodage";
"AVFoundationCFErrorDomain_AVCFErrorDecodeFailed_FailureReason" = "le décodeur a rencontré une erreur";
"AVFoundationCFErrorDomain_AVCFErrorEncodeFailed_Description" = "Échec d’encodage";
"AVFoundationCFErrorDomain_AVCFErrorEncodeFailed_FailureReason" = "l’encodeur a rencontré une erreur";

